notes/20230611215613-sicp_lecture1.org
:PROPERTIES:
:ID:       21c4bc13-f6b2-414c-81cb-4aa9edae4efd
:END:
#+title: sicp-lecture1

#+begin_quote
When a field is just getting started, it’s easy to confuse the essence of the field with its tools,
because we usually understand the tools much less well in the infancy of an area.
#+end_quote

There are two types of knowledge:
  1. Declaritive Knowledge
  2. Imperarive Knowledge

Computer science is mostly about "How to knoweledge" we want to be able to give computers instructiona and get the value, we can take this instructions or so called recipes and group them in what is known as a procedure(in modern time its called a function).



