notes/20230611215613-sicp_lecture1.tex
% Created 2023-06-12 Mon 12:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Andrew Lamichhane}
\date{\today}
\title{sicp-lecture1}
\hypersetup{
 pdfauthor={Andrew Lamichhane},
 pdftitle={sicp-lecture1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.7-pre)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{quote}
When a field is just getting started, it’s easy to confuse the essence of the field with its tools,
because we usually understand the tools much less well in the infancy of an area.
\end{quote}

There are two types of knowledge:
\begin{enumerate}
\item Declaritive Knowledge
\item Imperarive Knowledge
\end{enumerate}

Computer science is mostly about "How to knoweledge" we want to be able to give computers instructiona and get the value, we can take this instructions or so called recipes and group them in what is known as a procedure(in modern time its called a function).
\end{document}